Repository: rfakeeh/sheap-app
Catalog: flutter/releases/sheap_app_v9/lib/l10n/app_*.arb
Languages: ar

source: Sign Up
ar: تسجيل

source: Sign In
ar: دخول

source: Welcome Page
ar: الشاشة الرئيسية

source: Home
ar: الرئيسية

source: Map View
ar: عرض الخريطة

# fillFields
source: Please fill the following fields
ar: فضلا ، أدخل البيانات التالية

source: Username
ar: اسم المستخدم

# usernameHint
source: three-part name
ar: الاسم الثلاثي

# userId
source: National ID / Iqama number
ar: رقم الهوية الوطنية / الاقامة

# userPhone
source: Phone number
ar: رقم الهاتف

# signUpTerms
source: By signing up, I agree to the app's Terms of Service and Privacy Policy.
ar: من خلال التسجيل ، فأنا أوافق على شروط الخدمة وسياسة الخصوصية الخاصة بالتطبيق.

# signInTerms
source: By signing in, I agree to the app's Terms of Service and Privacy Policy.
ar: من خلال الدخول ، فأنا أوافق على شروط الخدمة وسياسة الخصوصية الخاصة بالتطبيق.

# otpVerify
source: OTP Verification
ar: رمز التحقق

# otpVerifyPhone
source: A verification code will be sent to your mobile
ar: سيتم إرسال رمز التحقق إلى رقم جوالك

# otpVerifyChangePhone
source: Change mobile number
ar: تغيير رقم الجوال

# otpVerifyReset
source: Didn't receive the code? Resend in
ar: لم يصلك رمز الدخول؟ أعد الإرسال خلال

# otpVerifyAskReset
source: Resend OTP code ?
ar: إعادة الإرسال ؟

# otpVerifySeconds
source: seconds
ar: ثانية

# otpVerifySigning
source: Signing in ...
ar: جاري تسجيل الدخول ...

# otpVerifyConfirm
source: Confirm OTP
ar: تأكيد رمز التحقق

# otpVerifying
source: VerIfying OTP ...
ar: جاري التحقق من الرمز ...

# fillAllFields
source: Please fill all fields.
ar: فضلا قم بتعبئة جميع البيانات.

# incorrectFields
source: Incorrect ID or phone number.
ar: رقم هاتف أو هوية غير مسجّل!

# userExists
source: A user with this phone number already exists!
ar: رقم الهاتف هذا مسجل مسبقا.

source: Sign Out
ar: تسجيل الخروج

source: Welcome,
ar: مرحبا ،

source: Back
ar: رجــــوع

source: Loading ...
ar: تحميل ...

# locationServiceDisabled
source: Location service is disabled.
ar: خدمة تحديد الموقع غير مفعّلة.

# permissionsDenied
source: Permissions are denied.
ar: تم منع الأذونات للتطبيق.

source: Location
ar: الموقع

source: Locations
ar: مواقع

source: Group
ar: مجموعة

source: Groups
ar: المجموعات

source: The
ar: ال

source: My
ar: ي

source: Holy
ar: مقدسة

source: Important
ar: مهمة

source: Holy Locations
ar: المواقع المقدّسة

source: Hajj Locations
ar: مواقع الحج

source: Search ...
ar: بحث ...

# noResults
source: No results found.
ar: لا توجد نتائج

# createdGroups
source: You have created
ar: التي قمت بإنشائها

# createNewGroup
source: Add Group
ar: إنشاء مجموعة

# noCreatedGroups
source: You don't have any groups.
ar: ليس لديك أي مجموعة.

# joinedGroups
source: You have joined
ar: التي انضممت إليها

# joinNewGroup
source: Join Group
ar: انضم لمجموعة

# noJoinedGroups
source: You haven't joined any active groups yet.
ar: لم تقم بالانضمام لأي مجموعة نشطة.

source: Tracking On
ar: التتبّع مفعّل

# enableTracking
source: Activate Tracking
ar: تفعيل التتبّع

source: Tracking Off
ar: التتبّع غير مفعّل

# disableTracking
source: Deactivate Tracking
ar: إيقاف التتبّع

source: Leader
ar: المرشد

# allMembersSafe
source: All members are safe.
ar: جميع الأعضاء بأمان.

# outsideGeofence
source: member(s) are outside geofence
ar: أعضاء خارج منطقة الأمان

# sentSOS
source: member(s) have sent SOS
ar: أعضاء في حالة طوارئ

source: and
ar: و

# edit
source: Edit Group
ar: تعديل المجموعة

# delete
source: Delete Group
ar: حذف المجموعة

# exit
source: Exit Group
ar: مغادرة المجموعة

# navigateToDestination
source: To Destination
ar: الذهاب للوجهة

# destination
source: To
ar: الوجهة

# navigateToLeader
source: To Leader
ar: الذهاب للمرشد

source: Alert Group
ar: تنبيه للمجموعة

# showQR
source: Show Group QR
ar: عرض رمز QR

# addMemberByPhone
source: Invite By Phone Number
ar: أضف عضوا برقم الهاتف

# addMemberByQR
source: Invite By QR Code
ar: أضف عضوا برمز QR

# scanQrToJoin
source: Scan this QR to join the group
ar: امسح هذا الرمز للانضمام إلى المجموعة

source: Share
ar: مشاركة

source: Add
ar: إضافة

source: Invite Member
ar: إرسال دعوة

# memberAcceptance
source: An invitation will be sent. The member must accept to join.
ar: ستُرسل دعوة، ويجب على العضو قبولها أولا للانضمام.

# enterPhoneNumber
source: Please enter a phone number.
ar: الرجاء إدخال رقم الهاتف.

# numberNotRegistered
source: This number is not registered in the app.
ar: هذا الرقم غير مسجّل في التطبيق.

source: Group not found.
ar: لم يتم العثور على المجموعة.

# userAlreadyMember
source: This user is already a member of the group.
ar: هذا المستخدم عضو بالفعل في المجموعة.

# receivedGroupInvitation
source: Has invited you to
ar: قام/ـت بدعوتك إلى

# rejectedGroupInvitation
source: Has rejected your invitation to join
ar: لقد رفض/ـت دعوتك للانضمام إلى

# acceptedGroupInvitation
source: Has accepted your invitation to join
ar: لقد قبل/ـت دعوتك للانضمام إلى

# leftGroup
source: Has left
ar: لقد قام/ـت بمغادرة

# joinedGroup
source: Has joined
ar: لقد قام/ـت بالانضمام إلى

source: via QR.
ar: عبر رمز QR.

# doYouWantToJoin
source: Would you like to join?
ar: هل ترغب بالانضمام للمجموعة؟

# invitationSent
source: Invitation sent successfully.
ar: تم إرسال الدعوة بنجاح.

# invitationAlreadySent
source: You have already sent an invitation to this member. Please wait for their response.
ar: لقد أرسلت دعوة لهذا العضو بالفعل. يرجى انتظار ردّه.

# invitationFailed
source: Failed to send invitation. Please try again.
ar: فشل إرسال الدعوة. يرجى المحاولة مرة أخرى.

# sentSosRequest
source: An SOS request was sent by this member
ar: ورد نداء استغاثة من هذا العضو

# clickToHelpOrDismiss
source: Click to navigate to member for help or dismiss.
ar: انقر للذهاب إلى الموقع وتقديم المساعدة أو التجاهل.

# confirmDelete
source: Are you sure you want to delete
ar: هل ترغب حقا بحذف

source: Yes
ar: موافق

source: No
ar: غير موافق

source: Cancel
ar: إلغاء

# groupDeleted
source: Group deleted successfully.
ar: تم حذف المجموعة بنجاح.

# groupDeletedFailed
source: Failed to delete group.
ar: فشلت عملية حذف المجموعة.

# joinSuccess
source: You are currently a member of the group.
ar: تم الانضمام بنجاح لهذه المجموعة.

# joinAlreadyMember
source: You are already a member of the group.
ar: أنت عضو بالفعل في هذه المجموعة.

# scanQR
source: Scan QR to join a group
ar: مسح رمز QR للإنضمام إلى مجموعة

# confirmJoinGroup
source: Join this group?
ar: هل ترغب حقا بالانضمام لهذه المجموعة؟

source: Group ID
ar: رقم المجموعة

# confirmExit
source: Are you sure you want to exit the group?
ar: هل ترغب حقا بالخروج من هذه المجموعة؟

# exitSuccess
source: You have exited the group
ar: تم الخروج من المجموعة

# exitFailed
source: Failed to exit group
ar: فشل الخروج من المجموعة

source: Unknown Address
ar: عنوان غير معروف

# confirmSosRequest
source: Are you sure you want to send SOS alert
ar: هل ترغب حقا بإرسال نداء استغاثة

# groupLeader
source: group's leader
ar: مرشد المجموعة

# allMembers
source: all group members
ar: كل أعضاء المجموعة

source: this group
ar: هذه المجموعة

# sosRequestFailed
source: Failed to send SOS alert. Try again.
ar: فشل إرسال نداء الاستغاثة. حاول مرة أخرى.

# sosRequestAlreadySent
source: You have already sent a pending SOS request. Please wait for their response.
ar: لقد أرسلت نداء استغاثة بالفعل. يرجى انتظار المساعدة.

# sosRequestSuccess
source: SOS request sent successfully.
ar: تم إرسال نداء الاستغاثة بنجاح.

# sosRequestSent
source: You have sent an SOS request
ar: لقد أرسلت نداء استغاثة

# cancelSosRequest
source: Please wait for help or click to cancel SOS request.
ar: فضلا ابق في مكانك وانتظر المساعدة أو انقر لإلغاء نداء الاستغاثة.

# cancelSosRequestSuccess
source: SOS request cancelled successfully.
ar: تم إلغاء نداء الاستغاثة بنجاح.

# sosRequestCancelled
source: SOS request was cancelled by this member
ar: تم إلغاء نداء الاستغاثة من هذا العضو

# confirmCancelSosRequest
source: Are you sure you want to cancel SOS request?
ar: هل ترغب حقا بإلغاء نداء الاستغاثة؟

# confirmNavigateMemberLocation
source: Are you sure you want to navigate to this member's location?
ar: هل ترغب حقا بالانتقال إلى موقع هذا العضو؟

# onTheWay
source: Currently is on the way
ar: حاليا في الطريق

source: to you
ar: إليك

source: to
ar: إلى

source: to member
ar: الى العضو

# inGroup
source: in
ar: في

# youOnTheWay
source: You are currently on the way
ar: أنت حاليا في الطريق

# clickIfArrivedOrToCancel
source: Click if you arrived at location or wish to cancel help.
ar: انقر اذا وصلت لموقع العضو أو لعدم المتابعة.

# confirmArrivedSosSenderLocation
source: Are you sure you have arrived at member's location?
ar: هل وصلت حقا إلى موقع العضو المستغيث؟

# confirmCancelSosSenderHelp
source: Are you sure you want to stop heading to the SOS request sender?
ar: هل ترغب حقا بإلغاء رحلتك إلى موقع العضو المستغيث؟

# arrivedSosMemberSuccess
source: Thanks God for safe arrival. Thank you for your help.
ar: الحمد لله على السلامة. شكرا لمساعدتك.

# onTheWayArrived
source: Currently is at
ar: حاليا في موقع

source: your location
ar: ك

# clickIfYouAreSafeOrDismiss
source: Click if you are safe or to dismiss.
ar: انقر إذا أصبحت بخير حاليا أو للتجاهل.

# theMemberLocation
source: the location of member
ar: العضو

# confirmYouAreSafe
source: Are you sure you are safe currently?
ar: هل أنت متأكد أنك أصبحت بخير حاليا؟

# sosMemberSafeSuccess
source: Thanks God you are safe currently.
ar: الحمد لله على السلامة.

# isSafe
source: This member is currently safe.
ar: هذا العضو أصبح بخير حاليا.

# cancelSosMemberOnTheWaySuccess
source: You cancelled your way to the SOS requester.
ar: لقد قمت بإلغاء رحلتك إلى موقع العضو المستغيث

# onTheWayCancelled
source: Have cancelled the way to
ar: قام/ـت بإلغاء الرحلة إلى موقع

# nMembers
source: Members
ar: عدد الأعضاء

# nSos
source: SOS Now
ar: حالة طارئة

# nOutsideGeofence
source: Outside
ar: خارج السياج
